ingredient_dict = {

    "納豆":[
        "納豆"
    ],

    "味噌汁":[
        "味噌",
        "豆腐",
        "ねぎ"
    ],

    "鮭の塩焼き":[
        "鮭"
    ],

    "鶏むね肉の照り焼き":[
        "鶏むね肉",
        "醤油"
    ],

    "豚しゃぶサラダ":[
        "豚肉",
        "レタス",
        "トマト"
    ],

    "さばの塩焼き":[
        "さば"
    ],

    "野菜炒め":[
        "キャベツ",
        "にんじん",
        "玉ねぎ"
    ],

    "卵焼き":[
        "卵"
    ],

    "ひじき煮":[
        "ひじき"
    ],

    "サラダ":[
        "レタス",
        "きゅうり",
        "トマト"
    ]

}